# Языки программирования делятся на языки со статической и динамической типизацией
# В языках со статической типизаций перед присвоением значения к переменной
# необходимо указать её тип: int, String, bool и т.д.
# В языках с динамической типизацией тип переменной определяется присвоенным
# ей значением


# Правила работы с переменными
# 1. Всегда выбирать осмысленные названия
# 2. В названиях переменных использовать имя существительное, например
# name, comments, new_photos.
# Имя переменной должно отвечать на вопрос: Что содержит?
# 3. Названия функций и методов начинать с глагола, например get_data, create_request, merge_names
# Имя функции или метода должно отвечать на вопрос: Что выполняет или возвращает?
