# int()


# float()
# Явное преобразование. 
# Число с плавающей точкой нельзя неявно преобразовать в целое число.
# Для такого преобразования необходимо использовать явное преобразование с помощью команды int().

# преобразование чисел с плавающей точкой в целое производится с округлением в сторону нуля,
# то есть int(1.7) = 1, int(-1.7) = -1
# не путайте операцию преобразования и округления.


# str()
# Строку можно умножать на число, но нельзя умножать на строку.

# Основные функции
# len(str) = подсчет количества символов в строке (включая пробелы)
# str() = конвертация в строку
