from math import *
# Для того чтобы не указывать название модуля и символ точки при вызове функций, мы пишем следующий код:
# from math import *. ЛУЧШЕ ТАКОЙ ВИД НЕ ИСПОЛЬЗОВАТЬ!

# Используем import math или указываем конкретные функции
# если нужно использовать только конкретные некоторые функции, указываем их следующим образом
# from math import sqrt, ceil

# Константы
# e == 2.71
# pi == 3.14

# Список функций по категориям
# Округление
# int() в сторону нуля
# round(x) до ближайшего целого. Если дробная часть == 0.5, то до ближайшего четного числа
# round(x, n) число x до n знаков после точки
# floor(x) округление вниз
# ceil(x) округление вверх
# abs(x) модуль

# Корни, логарифмы, степени и факториал
# sqrt(x) квадратный корень
# pow(x, n) возведение числа x в степень n
# log(x) натуральный логарифм числа x. Основание натурального логарифма == числу e(2.71)
# log10(x) десятичный логарифм числа x. Основание десятичного логарифма == числу 10
# log(x, n) логарифм числа x по основанию к числу n
# factorial(x) факториал натурального числа x

# Тригонометрия
# degrees(x) - преобразует угол x, заданный в радианах в градусы
# radians(x) - преобразует угол x, заданный в градусах в радианы
# cos(x) - косинус угла x, задаваемого в радианах
# sin(x) - синус угла x, задаваемого в радианах
# tan(x) - тангенс угла x, задаваемого в радианах
